let name = 'number';
let name1 = 23;
let name2 = 23;
console.log('number' + 23 + 23) // number2323
//перший бінарний оператор приводить до строки, тому, що один операнд є строкою: number23, 
//і другий бінарний оператор теж приводить до строки, обєднуючи, а не додаючи 23.

console.log(41 + 1 + 'number') // 42number
// перший бінарний оператор складає два числа 41+1=42, а другий бінарний оператор 
//приводить до строки, тому, що операнд 'number'є строкою - 42number

console.log(null + 1) // 1
//операнд “нічого” унарним оператором приводиться до числа "0" і складається з "1": 0 + 1 = 1.

 console.log('five' + + 'two') //  fiveNaN
 // перший операнд строка 'five';
 // унарний оператор +  попереду строки 'two' призводить її до NaN
 // бінарний оператор + складає строку 'five' та NaN.
 

console.log(2 && 7) // 7
// обидва аргументи істінни, то вернув останній - 7

console.log(+'40' + +'2') // 42
// унарний оператор преобразує строку сорок в число 40. Так само
// і оператор + преобразує строку два у число 2, а бінарний оператор
// + складає число 40 і 2.

 console.log('10' - 5 === 6) // false
// бінарний мінус віднімає від 10 п'ять, приводячи строку до числа,
// далі перевіряється строге равенство 5 === 6, яке хибне, бо 6 більше 5, тому:false. 

console.log(true + false); // 1
// оператор + приводить логічні значення до цілих
// чисел - тому true стає 1, а false стає 0. 1+0=1.

console.log('4px' - 3) // NaN
//оператор - працює тільки з числами.

console.log('4' - 3) // 1
//бінарний мінус віднімає від 4 трійку: 4-3=1.

console.log('2' + 3 ** 2);  // 29
// спочатку возводимо у степень трійку: 3*3*3=27, 
// оператор + преобразує строку два у число 2,
// 2 + 27 = 29.

console.log(12 / '6'); // 2
// оператор / перетворив операнд строку 6 на число 6: 12/6=2.

console.log(23 + 42 + 'number') // 65number
// унарний оператор спочатку складає числа 23+42=65 і далі
// 65 унарний оператор зєднує зі строкою 'number'- 65number.

console.log('10' + (5 === 6)); // 10false
// перевіряється спочатку строга рівність, і в нас 5 менше 6,
// що відповідає fals. Далі до строки '10' бінарним оператором додається
// false і в нас виходить строка: 10false.

console.log('number' + 15 + 3); //number153
// перший бінарний оператор об*єднує строку 'number'з числом 15:'number' + 15 виходить строка: number15,
// до строки number15 бінарний оператор додає число 3, отримуємо строку: number153.

console.log(undefined + 1); // NaN
// undefined ні на що не перетворюється, складається з операндом числом 1 та 
// виводить NaN - не число там, де очікуємо число.

console.log('true' == true) // false
// при порівнянні нечисловий рядок 'true' конвертується в NaN , що завжди є false, і
// true не дорівнює false.

console.log(false == 'false') // false
//  false, тому що порівнюються різні типи.

console.log(null == '')  // false
// при виконанні порівняння пустий рядок конвертується в 0,
// у нестрогому рівнянні == значення null  значения ни до чого не привоиться,
// і не рівно нічому іншому, тому значення null == 0 false.

console.log(3 ** (9 / 3)); // 27
// 9 / 3 = 3, 
// 3 x 3 x 3 = 27/

console.log(!!'false' == !!'true') // true
// !!'false'перетворюється на NaN, і 'true' перетворюється на NaN,
// NaN === NaN і це правда.

console.log(0 || '0' && 1) // 1
// && повертає число 1 тому, що два значення рівні,
// || повертає число 1 тому, що це значення рівне true.

console.log(1 < 2 < 3) // true
// 1 < 2  це правда, 
// 2 < 3 це правда.

console.log('foo'+ + +'bar') //fooNaN
// операнд 'bar' не є числом, унарний плюс перетворює його на число.
// + +'bar'помилка дає рядок NaN.
// об*єдную рядки 'foo' та NaN через бінарний +: fooNaN.

console.log(3 ** 2 / 3); // 3
// 3 x 3 = 9,
// 9 / 3 = 3.

console.log(1 < 2 > 3) // false
// 1 < 2 це true,
// 2 > 3 це false.

console.log((+null == false) < 1); // false
// оператор + приводить null до числа 0, 0 == false буде true,
// true < 1  тут true перетворюється на 1. 
// 1 < 1 буде неправдою.

console.log( false && true || true) // true
// && поверне false,
// false || true   оператор || поверне true.

console.log(false && (true || true)); // false
//true || true  повернеться true,
// false && true повернеться false.

console.log((+null == false) < 1 ** 5); // false
// оператор + приводить null до числа 0, 0 == false буде true,
// 1 x 1 x 1 x 1 x 1 = 1,
// true < 1 тут true перетворюється на 1. 
// 1 < 1 буде неправдою.
